УТ_для_edt/src/ExchangePlans/смартОбменССервисомРечевойАналитикиDeeray/смартОбменССервисомРечевойАналитикиDeeray.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="cf5926a7-95b6-436c-9502-ceff69041970">
  <name>смартОбменССервисомРечевойАналитикиDeeray</name>
  <comment>#4570 смарт: Ермаков 09.10.2025</comment>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСостоянийИнтересов</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресAPIDeeray</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенAPIDeeray</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SecretKeyAPIDeeray</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайламЗагрузки</name>
    <comment>#4942 смарт: Тимофеева 10.11.2025 / Загрузка суммарных данных Deeray</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыгружаемыеТеги</name>
    <comment># смарт: Ермаков 09.10.2025</comment>
    <attributes>
      <name>Тег</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

УТ_для_edt/src/ExchangePlans/смартОбменССервисомРечевойАналитикиDeeray/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

///////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

#Область СлужебныеПроцедурыИФункции

Функция ВыбратьДанные(УзелОбмена, ПользовательскиеНастройки = Неопределено, ОтбиратьТолькоИзменения = Истина) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УзелОбмена, 
		"ХранилищеСхемыКомпоновкиДанных, ХранилищеНастроекКомпоновкиДанных, ДатаНачала, ВыгружаемыеТеги");

	// Схема компоновки данных
	СхемаКомпоновкиДанных = Реквизиты.ХранилищеСхемыКомпоновкиДанных.Получить();
	
	ТаблицаВыгружаемыхТегов = Реквизиты.ВыгружаемыеТеги.Выгрузить();
	
	ВыборкаПолейТегов = "";
	ПоляТегов = "";
	СоединенияТаблицПолейТегов = "";
	РеквизитыТегов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ТаблицаВыгружаемыхТегов.ВыгрузитьКолонку("Тег"), "ИдентификаторДляФормул");
	Для Каждого КлючИЗначение Из РеквизитыТегов Цикл
		ИдентификаторДляФормул = КлючИЗначение.Значение.ИдентификаторДляФормул;
		ВыборкаПолейТегов = ВыборкаПолейТегов + СтрШаблон("ЕСТЬNULL(ВложенныйЗапрос%1.Значение, """") КАК %1,", ИдентификаторДляФормул);
		ПоляТегов = ПоляТегов + СтрШаблон("%1,", ИдентификаторДляФормул);
		СоединенияТаблицПолейТегов = СоединенияТаблицПолейТегов + СтрШаблон("
																			|ЛЕВОЕ СОЕДИНЕНИЕ СвойстваЗначенияЗвонков КАК ВложенныйЗапрос%1
																			|	ПО (ВложенныйЗапрос%1.Объект = ВТ_Звонки.ТелефонныйЗвонок)
																			|	И (ВложенныйЗапрос%1.ИдентификаторДляФормул = ""%1"")", 
																			ИдентификаторДляФормул); 
	КонецЦикла;
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ВыборкаПолейТегов%", ВыборкаПолейТегов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ПоляТегов%", ПоляТегов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%СоединенияТаблицПолейТегов%", СоединенияТаблицПолейТегов);
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = ТекстЗапроса;

	// Загрузка настроек
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	НастройкиКомпоновкиДанных = Реквизиты.ХранилищеНастроекКомпоновкиДанных.Получить();
	Если НастройкиКомпоновкиДанных <> Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
	КомпоновщикНастроек.Восстановить();
	
	Если ПользовательскиеНастройки <> Неопределено Тогда		
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);  	
	КонецЕсли; 

	Для Каждого КлючИЗначение Из РеквизитыТегов Цикл
		ИдентификаторДляФормул = КлючИЗначение.Значение.ИдентификаторДляФормул;
		
		ВыбранноеПолеКомпоновкиДанных = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
        ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(ИдентификаторДляФормул);
	КонецЦикла;
	
	// Установка параметров данных
	ПараметрКомпановкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Узел");
	ПараметрКомпановкиДанных.Значение = УзелОбмена;
	ПараметрКомпановкиДанных.Использование = Истина;
	
	ПараметрКомпановкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОтбиратьТолькоИзменения");
	ПараметрКомпановкиДанных.Значение = ОтбиратьТолькоИзменения;
	ПараметрКомпановкиДанных.Использование = Истина;
	
	ПараметрКомпановкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачала");
	ПараметрКомпановкиДанных.Значение = Реквизиты.ДатаНачала;
	ПараметрКомпановкиДанных.Использование = Истина;	

	ПараметрКомпановкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РодительСостояниеИнтереса");
	ПараметрКомпановкиДанных.Значение = Справочники.CRM_СостоянияИнтересов.НайтиПоНаименованию("Продажа Оборудования, Материалов, ЗЧ");
	ПараметрКомпановкиДанных.Использование = Истина;	
    
	// Компоновка макета
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	
	// Таблица значений, в которую будет получен результат
	Результат = Новый ТаблицаЗначений;
	
	// Получение результата
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений.УстановитьОбъект(Результат);
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат Результат;
	
КонецФункции   

Процедура ВыбратьДанныеВТабличныйДокумент(УзелОбмена, ТабличныйДокумент, ПользовательскиеНастройки = Неопределено, ОтбиратьТолькоИзменения = Истина) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УзелОбмена, 
		"ХранилищеСхемыКомпоновкиДанных, ХранилищеНастроекКомпоновкиДанных, ДатаНачала, ВыгружаемыеТеги");

	// Схема компоновки данных
	СхемаКомпоновкиДанных = Реквизиты.ХранилищеСхемыКомпоновкиДанных.Получить();
	
	ТаблицаВыгружаемыхТегов = Реквизиты.ВыгружаемыеТеги.Выгрузить();
	
	ВыборкаПолейТегов = "";
	ПоляТегов = "";
	СоединенияТаблицПолейТегов = "";
	РеквизитыТегов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ТаблицаВыгружаемыхТегов.ВыгрузитьКолонку("Тег"), "ИдентификаторДляФормул");
	Для Каждого КлючИЗначение Из РеквизитыТегов Цикл
		ИдентификаторДляФормул = КлючИЗначение.Значение.ИдентификаторДляФормул;
		ВыборкаПолейТегов = ВыборкаПолейТегов + СтрШаблон("ЕСТЬNULL(ВложенныйЗапрос%1.Значение, """") КАК %1,", ИдентификаторДляФормул);
		ПоляТегов = ПоляТегов + СтрШаблон("%1,", ИдентификаторДляФормул);
		СоединенияТаблицПолейТегов = СоединенияТаблицПолейТегов + СтрШаблон("
																			|ЛЕВОЕ СОЕДИНЕНИЕ СвойстваЗначенияЗвонков КАК ВложенныйЗапрос%1
																			|	ПО (ВложенныйЗапрос%1.Объект = ВТ_Звонки.ТелефонныйЗвонок)
																			|	И (ВложенныйЗапрос%1.ИдентификаторДляФормул = ""%1"")", 
																			ИдентификаторДляФормул); 
	КонецЦикла;
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ВыборкаПолейТегов%", ВыборкаПолейТегов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ПоляТегов%", ПоляТегов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%СоединенияТаблицПолейТегов%", СоединенияТаблицПолейТегов);
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = ТекстЗапроса;
	
	// Загрузка настроек
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	НастройкиКомпоновкиДанных = Реквизиты.ХранилищеНастроекКомпоновкиДанных.Получить();
	Если НастройкиКомпоновкиДанных <> Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
	КомпоновщикНастроек.Восстановить();
	
	Если ПользовательскиеНастройки <> Неопределено Тогда		
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);		
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из РеквизитыТегов Цикл
		ИдентификаторДляФормул = КлючИЗначение.Значение.ИдентификаторДляФормул;
		
		ВыбранноеПолеКомпоновкиДанных = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
        ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(ИдентификаторДляФормул);
	КонецЦикла;
	
	// Установка параметров данных
	ПараметрКомпановкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Узел");
	ПараметрКомпановкиДанных.Значение = УзелОбмена;
	ПараметрКомпановкиДанных.Использование = Истина;
	
	ПараметрКомпановкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОтбиратьТолькоИзменения");
	ПараметрКомпановкиДанных.Значение = ОтбиратьТолькоИзменения;
	ПараметрКомпановкиДанных.Использование = Истина;
	
	ПараметрКомпановкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачала");
	ПараметрКомпановкиДанных.Значение = Реквизиты.ДатаНачала;
	ПараметрКомпановкиДанных.Использование = Истина;	

	ПараметрКомпановкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РодительСостояниеИнтереса");
	ПараметрКомпановкиДанных.Значение = Справочники.CRM_СостоянияИнтересов.НайтиПоНаименованию("Продажа Оборудования, Материалов, ЗЧ");
	ПараметрКомпановкиДанных.Использование = Истина;	
    
	// Компоновка макета
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки());
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
